# BendingDetailTypeOrthogonalAndOverallDimesionsEnabled Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..BendingDetailTypeOrthogonalAndOverallDimesionsEnabled Property
ParameterTypeId Class See Also
---
"Other Dimensions"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId BendingDetailTypeOrthogonalAndOverallDimesionsEnabled { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property BendingDetailTypeOrthogonalAndOverallDimesionsEnabled As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ BendingDetailTypeOrthogonalAndOverallDimesionsEnabled {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace